SarveshPatil7/Work-on-TI-F28379D/workspace/LAB6/LAB6_main.c
    // Interrupts that are used in this example are re-mapped to
    // ISR functions found within this project
    EALLOW;  // This is needed to write to EALLOW protected registers
    PieVectTable.TIMER0_INT = &cpu_timer0_isr;
    PieVectTable.TIMER1_INT = &cpu_timer1_isr;
    PieVectTable.TIMER2_INT = &cpu_timer2_isr;
    PieVectTable.SCIA_RX_INT = &RXAINT_recv_ready;
    PieVectTable.SCIB_RX_INT = &RXBINT_recv_ready;
    PieVectTable.SCIC_RX_INT = &RXCINT_recv_ready;
    PieVectTable.SCID_RX_INT = &RXDINT_recv_ready;
    PieVectTable.SCIA_TX_INT = &TXAINT_data_sent;
    PieVectTable.SCIB_TX_INT = &TXBINT_data_sent;
    PieVectTable.SCIC_TX_INT = &TXCINT_data_sent;
    PieVectTable.SCID_TX_INT = &TXDINT_data_sent;
    PieVectTable.SPIB_RX_INT = &SPIB_isr;

    PieVectTable.EMIF_ERROR_INT = &SWI_isr;
    // ----- code for CAN start here -----
    PieVectTable.CANB0_INT = &can_isr;
    // ----- code for CAN end here -----	
    EDIS;    // This is needed to disable write to EALLOW protected registers


    // Initialize the CpuTimers Device Peripheral. This function can be
    // found in F2837xD_CpuTimers.c
    InitCpuTimers();

    // Configure CPU-Timer 0, 1, and 2 to interrupt every given period:
    // 200MHz CPU Freq,                       Period (in uSeconds)
    ConfigCpuTimer(&CpuTimer0, LAUNCHPAD_CPU_FREQUENCY, 1000);
    ConfigCpuTimer(&CpuTimer1, LAUNCHPAD_CPU_FREQUENCY, 125000);
    // BM: use cpu timer2 for readying wheels, set to 4ms
    ConfigCpuTimer(&CpuTimer2, LAUNCHPAD_CPU_FREQUENCY, 4000);

    // Enable CpuTimer Interrupt bit TIE
    CpuTimer0Regs.TCR.all = 0x4000;
    CpuTimer1Regs.TCR.all = 0x4000;
    CpuTimer2Regs.TCR.all = 0x4000;

	init_serialSCIA(&SerialA,115200);



    setupSpib();
    // BM: call the function according to the requirement
    init_eQEPs();

    /********************* BM: for the epwm part *************************/
    // BM: setting EPWM2 REGs
	// BM: setting TBCTL registers
	EPwm2Regs.TBCTL.bit.FREE_SOFT = 2;
	EPwm2Regs.TBCTL.bit.CTRMODE = 0;
	EPwm2Regs.TBCTL.bit.CLKDIV = 0;
	EPwm2Regs.TBCTL.bit.PHSEN = 0;
	// BM: set TBCTR registers
	EPwm2Regs.TBCTR = 0;
	// BM: set TBPRD registers, set to 20kHz
	EPwm2Regs.TBPRD = 2500;
	// BM: set CMPA registers
	EPwm2Regs.CMPA.bit.CMPA = 0;
	// BM: set CMPB registers for EPM2B
	EPwm2Regs.CMPB.bit.CMPB = 0;
	// BM: set AQCTLA registers
	EPwm2Regs.AQCTLA.bit.CAU = 1;
	EPwm2Regs.AQCTLA.bit.ZRO = 2;
	// BM: set AQCTLB registers for EPM2B
	EPwm2Regs.AQCTLB.bit.CBU = 1;
	EPwm2Regs.AQCTLB.bit.ZRO = 2;
	// BM: set TBPHS registers
	EPwm2Regs.TBPHS.bit.TBPHS = 0;
	// BM: set pinmux for the correct GPIO according to the PinMuxTable
	GPIO_SetupPinMux(2, GPIO_MUX_CPU1, 1);
	GPIO_SetupPinMux(3, GPIO_MUX_CPU1, 1);

	// BM: setting EPWM9 REGs
	// BM: setting TBCTL registers
	EPwm9Regs.TBCTL.bit.FREE_SOFT = 2;
	EPwm9Regs.TBCTL.bit.CTRMODE = 0;
	EPwm9Regs.TBCTL.bit.CLKDIV = 1; // BM: set to 1 according to the instruction
	EPwm9Regs.TBCTL.bit.PHSEN = 0;
	// BM: set TBCTR registers
	EPwm9Regs.TBCTR = 0;
	// BM: set TBPRD registers
	EPwm9Regs.TBPRD = 2500;
	// BM: set CMPA registers, not needed for exercise 4
	//  EPwm9Regs.CMPA.bit.CMPA = 0;
	// BM: set AQCTLA registers
	// BM: ignore CMPA by setting CAU to 0
	EPwm9Regs.AQCTLA.bit.CAU = 0;
	// BM: create square wave by setting ZRO to 3
	EPwm9Regs.AQCTLA.bit.ZRO = 3;
	// BM: set TBPHS registers
	EPwm9Regs.TBPHS.bit.TBPHS = 0;
	// BM: set pinmux for the correct GPIO according to the PinMuxTable
	GPIO_SetupPinMux(16, GPIO_MUX_CPU1, 5);

    EALLOW; // Below are protected registers
    GpioCtrlRegs.GPAPUD.bit.GPIO2 = 1; // For EPWM2A
    GpioCtrlRegs.GPAPUD.bit.GPIO3 = 1; // For EPWM2B
    GpioCtrlRegs.GPAPUD.bit.GPIO16 = 1; // For EPWM9A
    EDIS;
	
    // Enable CPU int1 which is connected to CPU-Timer 0, CPU int13
    // which is connected to CPU-Timer 1, and CPU int 14, which is connected
    // to CPU-Timer 2:  int 12 is for the SWI.  
    IER |= M_INT1;
	IER |= M_INT6;
    IER |= M_INT8;  // SCIC SCID
    IER |= M_INT9;  // SCIA  CANB
    IER |= M_INT12;
    IER |= M_INT13;
    IER |= M_INT14;

    // Enable TINT0 in the PIE: Group 1 interrupt 7
    PieCtrlRegs.PIEIER1.bit.INTx7 = 1;
	// Enable SWI in the PIE: Group 12 interrupt 9
    PieCtrlRegs.PIEIER12.bit.INTx9 = 1;
	PieCtrlRegs.PIEIER6.bit.INTx3 = 1;  //SPiB
    // ----- code for CAN start here -----
    // Enable CANB in the PIE: Group 9 interrupt 7
    PieCtrlRegs.PIEIER9.bit.INTx7 = 1;
    // ----- code for CAN end here -----

    // ----- code for CAN start here -----
    // Enable the CAN interrupt signal
    CanbRegs.CAN_GLB_INT_EN.bit.GLBINT0_EN = 1;
    // ----- code for CAN end here -----
	
	init_serialSCIC(&SerialC,115200);
	init_serialSCID(&SerialD,115200);
    // Enable global Interrupts and higher priority real-time debug events
    EINT;  // Enable Global interrupt INTM
    ERTM;  // Enable Global realtime interrupt DBGM


    // ----- code for CAN start here -----

    //    // Transmit Message
    //    // Initialize the transmit message object used for sending CAN messages.
    //    // Message Object Parameters:
    //    //      Message Object ID Number: 0
    //    //      Message Identifier: 0x1
    //    //      Message Frame: Standard
    //    //      Message Type: Transmit
    //    //      Message ID Mask: 0x0
    //    //      Message Object Flags: Transmit Interrupt
    //    //      Message Data Length: 4 Bytes
    //    //
    //    CANsetupMessageObject(CANB_BASE, TX_MSG_OBJ_ID, 0x1, CAN_MSG_FRAME_STD,
    //                           CAN_MSG_OBJ_TYPE_TX, 0, CAN_MSG_OBJ_TX_INT_ENABLE,
    //                           TX_MSG_DATA_LENGTH);

    // Measured Distance from 1
    // Initialize the receive message object 1 used for receiving CAN messages.
    // Message Object Parameters:
    //      Message Object ID Number: 1
    //      Message Identifier: 0x060b0101
    //      Message Frame: Standard
    //      Message Type: Receive
    //      Message ID Mask: 0x0
    //      Message Object Flags: Receive Interrupt
    //      Message Data Length: 8 Bytes (Note that DLC field is a "don't care"
    //      for a Receive mailbox)
    //
    CANsetupMessageObject(CANB_BASE, RX_MSG_OBJ_ID_1, 0x060b0101, CAN_MSG_FRAME_EXT,
                          CAN_MSG_OBJ_TYPE_RX, 0, CAN_MSG_OBJ_RX_INT_ENABLE,
                          RX_MSG_DATA_LENGTH);

