SarveshPatil7/Work-on-TI-F28379D/workspace/LAB6/LAB6_main.c
// cpu_timer1_isr - CPU Timer1 ISR
__interrupt void cpu_timer1_isr(void)
{
    // BM: increment the counter for song
    song_count++;
    // BM: check counter bounding
    if (song_count > SONG_LENGTH) {
        song_count = 0;
    }

    // BM: set TBPRD for EPwm9Regs
    EPwm9Regs.TBPRD = songarray[song_count];
    CpuTimer1.InterruptCount++;
}

// cpu_timer2_isr CPU Timer2 ISR
__interrupt void cpu_timer2_isr(void)
{
	// Blink LaunchPad Blue LED
    GpioDataRegs.GPATOGGLE.bit.GPIO31 = 1;

    CpuTimer2.InterruptCount++;
    // BM: calling functions to check wheel rotation angles
    // BM: in rad
    LeftWheel_rad = readEncLeft();
    RightWheel_rad = readEncRight();
    PosLeft[1] = PosLeft[0];
    PosLeft[0] = LeftWheel_rad;
    VLeftK = (PosLeft[1] - PosLeft[0]) / 0.004;
    PosRight[1] = PosRight[0];
    PosRight[0] = RightWheel_rad;
    VRightK = (PosRight[1] - PosRight[0]) / 0.004;

    // BM: in m
    LeftWheel_m = LeftWheel_rad * RADTOMETER;
    RightWheel_m = RightWheel_rad * RADTOMETER;
    VLeftK_m = VLeftK * RADTOMETER;
    VRightK_m = VRightK * RADTOMETER;

    // BM: PID calculation
    e_turn = VLeftK_m - VRightK_m + turn;
    uRight = right_PID();
    uLeft = left_PID();
    // BM: set the EPWM2A according to the instruction
    setEPWM2A(uRight);  // BM: to control right wheel
    setEPWM2B(-uLeft);   // BM: to control left wheel

    // BM: calculating the x, y, and bearing
    coordinate_cal();


    if (NewLVData == 1) {
        NewLVData = 0;
//        V_ref = fromLVvalues[0];
//        turn = fromLVvalues[1];
//        printLV3 = fromLVvalues[2];
//        printLV4 = fromLVvalues[3];
//        printLV5 = fromLVvalues[4];
//        printLV6 = fromLVvalues[5];
//        printLV7 = fromLVvalues[6];
//        printLV8 = fromLVvalues[7];
        threshold_1 = fromLVvalues[3];
        threshold_2 = fromLVvalues[4];
        Kp_front = fromLVvalues[5];
        ref_front = fromLVvalues[6];

        Kp_right = fromLVvalues[7];
        ref_right = fromLVvalues[2];
    }
    if((CpuTimer2.InterruptCount%62) == 0) { // change to the counter variable of you selected 4ms. timer
        DataToLabView.floatData[0] = x;
        DataToLabView.floatData[1] = y;
//        DataToLabView.floatData[2] = bearing;
        DataToLabView.floatData[2] = ref_right;
        DataToLabView.floatData[3] = threshold_1;
        DataToLabView.floatData[4] = threshold_2;
        DataToLabView.floatData[5] = Kp_front;
        DataToLabView.floatData[6] = ref_front;
        DataToLabView.floatData[7] = Kp_right;
        LVsenddata[0] = '*'; // header for LVdata
        LVsenddata[1] = '$';
        for (int i=0;i<LVNUM_TOFROM_FLOATS*4;i++) {
            if (i%2==0) {
                LVsenddata[i+2] = DataToLabView.rawData[i/2] & 0xFF;
            } else {
                LVsenddata[i+2] = (DataToLabView.rawData[i/2]>>8) & 0xFF;
            }
        }
        serial_sendSCID(&SerialD, LVsenddata, 4*LVNUM_TOFROM_FLOATS + 2);
    }

    // BM: ex 8 song turing controller
    V_ref = track_speed;
    note = songarray[song_count];
    turn = (1.0 / (D4NOTE - A5NOTE) * note + (0.5 - D4NOTE / (D4NOTE - A5NOTE))) - shift;

    // BM: wall tracking controller
//    if (measure_status_1 == 0) {
//        distright = dis_1;
//    } else {
//        distright = 1400; // set to max reading if error
//    }
//    if (measure_status_3 == 0) {
//        distfront = dis_3;
//    } else {
//        distfront = 1400; // set to max reading if error
//    }
//
//    // BM: for ex 7 testing
////    turn = Kp_right * (ref_right - distright);
////    V_ref = track_speed;
//
//    if (right_wall_track == 1) {
//        turn = Kp_right * (ref_right - distright);
//        V_ref = track_speed;
//        if (distfront < threshold_1) {
//            right_wall_track = 0;
//        }
//    } else {
//        turn = Kp_front * (ref_front - distfront);
//        V_ref = track_speed;
//        if (distfront > threshold_2) {
//            right_wall_track = 1;
//        }
//    }

	
	if ((CpuTimer2.InterruptCount % 10) == 0) {
//		UARTPrint = 1;
	}
}

void setupSpib(void) //Call this function in main() somewhere after the DINT; line of code.
{
    int16_t temp = 0;
    //Step 1.
    // cut and paste here all the SpibRegs initializations you found for part 3. Make sure the TXdelay in between each transfer to 0. Also donâ€™t forget to cut and paste the GPIO settings for GPIO9, 63, 64, 65, 66 which are also a part of the SPIB setup.
    GPIO_SetupPinMux(9, GPIO_MUX_CPU1, 0); // Set as GPIO9 and used as DAN28027 SS
    GPIO_SetupPinOptions(9, GPIO_OUTPUT, GPIO_PUSHPULL); // Make GPIO9 an Output Pin
    GpioDataRegs.GPASET.bit.GPIO9 = 1; //Initially Set GPIO9/SS High so DAN28027 is not selected

    GPIO_SetupPinMux(66, GPIO_MUX_CPU1, 0); // Set as GPIO66 and used as MPU-9250 SS
    GPIO_SetupPinOptions(66, GPIO_OUTPUT, GPIO_PUSHPULL); // Make GPIO66 an Output Pin
    GpioDataRegs.GPCSET.bit.GPIO66 = 1; //Initially Set GPIO66/SS High so MPU-9250 is not selected

    GPIO_SetupPinMux(63, GPIO_MUX_CPU1, 15); //Set GPIO63 pin to SPISIMOB
    GPIO_SetupPinMux(64, GPIO_MUX_CPU1, 15); //Set GPIO64 pin to SPISOMIB
    GPIO_SetupPinMux(65, GPIO_MUX_CPU1, 15); //Set GPIO65 pin to SPICLKB

    EALLOW;
    GpioCtrlRegs.GPBPUD.bit.GPIO63 = 0; // Enable Pull-ups on SPI PINs Recommended by TI for SPI Pins
    GpioCtrlRegs.GPCPUD.bit.GPIO64 = 0;
    GpioCtrlRegs.GPCPUD.bit.GPIO65 = 0;
    GpioCtrlRegs.GPBQSEL2.bit.GPIO63 = 3; // Set I/O pin to asynchronous mode recommended for SPI
    GpioCtrlRegs.GPCQSEL1.bit.GPIO64 = 3; // Set I/O pin to asynchronous mode recommended for SPI
    GpioCtrlRegs.GPCQSEL1.bit.GPIO65 = 3; // Set I/O pin to asynchronous mode recommended for SPI
    EDIS;

    // ---------------------------------------------------------------------------
    SpibRegs.SPICCR.bit.SPISWRESET = 0; // Put SPI in Reset

    SpibRegs.SPICTL.bit.CLK_PHASE = 1; //This happens to be the mode for both the DAN28027 and
    SpibRegs.SPICCR.bit.CLKPOLARITY = 0; //The MPU-9250, Mode 01.
    SpibRegs.SPICTL.bit.MASTER_SLAVE = 1; // Set to SPI Master
    SpibRegs.SPICCR.bit.SPICHAR = 0xF; // Set to transmit and receive 16-bits each write to SPITXBUF
    SpibRegs.SPICTL.bit.TALK = 1; // Enable transmission
    SpibRegs.SPIPRI.bit.FREE = 1; // Free run, continue SPI operation
    SpibRegs.SPICTL.bit.SPIINTENA = 0; // Disables the SPI interrupt

    SpibRegs.SPIBRR.bit.SPI_BIT_RATE = 49; // Set SCLK bit rate to 1 MHz so 1us period. SPI base clock is
    // 50MHZ. And this setting divides that base clock to create SCLKâ€™s period
    SpibRegs.SPISTS.all = 0x0000; // Clear status flags just in case they are set for some reason

