SarveshPatil7/Work-on-TI-F28379D/workspace/LAB6/LAB6_main.c
        }

        lightlevel_3 = ((256.0*256.0*256.0)*lightlevel_raw_3[3] + (256.0*256.0)*lightlevel_raw_3[2] + 256.0*lightlevel_raw_3[1] + lightlevel_raw_3[0])/65535;
        quality_3 = ((256.0*256.0*256.0)*quality_raw_3[3] + (256.0*256.0)*quality_raw_3[2] + 256.0*quality_raw_3[1] + quality_raw_3[0])/65535;

        //
        // Getting to this point means that the RX interrupt occurred on
        // message object 2, and the message RX is complete.  Clear the
        // message object interrupt.
        //
        CANclearInterruptStatus(CANB_BASE, RX_MSG_OBJ_ID_4);

        //
        // Since the message was received, clear any error flags.
        //
        errorFlag = 0;
        GpioDataRegs.GPBCLEAR.bit.GPIO52 = 1;
    }



    //
    // If something unexpected caused the interrupt, this would handle it.
    //
    else
    {
        //
        // Spurious interrupt handling can go here.
        //
    }

    //
    // Clear the global interrupt flag for the CAN interrupt line
    //
    CANclearGlobalInterruptStatus(CANB_BASE, CAN_GLOBAL_INT_CANINT0);

    //
    // Acknowledge this interrupt located in group 9
    //
    InterruptclearACKGroup(INTERRUPT_ACK_GROUP9);
}
// ----- code for CAN end here -----


/********************* BM: New functions *****************************/
void init_eQEPs(void) {
    // setup eQEP1 pins for input
    EALLOW;
    //Disable internal pull-up for the selected output pins for reduced power consumption
    GpioCtrlRegs.GPAPUD.bit.GPIO20 = 1; // Disable pull-up on GPIO20 (EQEP1A)
    GpioCtrlRegs.GPAPUD.bit.GPIO21 = 1; // Disable pull-up on GPIO21 (EQEP1B)
    GpioCtrlRegs.GPAQSEL2.bit.GPIO20 = 2; // Qual every 6 samples
    GpioCtrlRegs.GPAQSEL2.bit.GPIO21 = 2; // Qual every 6 samples
    EDIS;
    // This specifies which of the possible GPIO pins will be EQEP1 functional pins.
    // Comment out other unwanted lines.
    GPIO_SetupPinMux(20, GPIO_MUX_CPU1, 1);
    GPIO_SetupPinMux(21, GPIO_MUX_CPU1, 1);
    EQep1Regs.QEPCTL.bit.QPEN = 0; // make sure eqep in reset
    EQep1Regs.QDECCTL.bit.QSRC = 0; // Quadrature count mode
    EQep1Regs.QPOSCTL.all = 0x0; // Disable eQep Position Compare
    EQep1Regs.QCAPCTL.all = 0x0; // Disable eQep Capture
    EQep1Regs.QEINT.all = 0x0; // Disable all eQep interrupts
    EQep1Regs.QPOSMAX = 0xFFFFFFFF; // use full range of the 32 bit count
    EQep1Regs.QEPCTL.bit.FREE_SOFT = 2; // EQep uneffected by emulation suspend in Code Composer
    EQep1Regs.QPOSCNT = 0;
    EQep1Regs.QEPCTL.bit.QPEN = 1; // Enable EQep
    // setup QEP2 pins for input
    EALLOW;
    //Disable internal pull-up for the selected output pinsfor reduced power consumption
    GpioCtrlRegs.GPBPUD.bit.GPIO54 = 1; // Disable pull-up on GPIO54 (EQEP2A)
    GpioCtrlRegs.GPBPUD.bit.GPIO55 = 1; // Disable pull-up on GPIO55 (EQEP2B)
    GpioCtrlRegs.GPBQSEL2.bit.GPIO54 = 2; // Qual every 6 samples
    GpioCtrlRegs.GPBQSEL2.bit.GPIO55 = 2; // Qual every 6 samples
    EDIS;
    GPIO_SetupPinMux(54, GPIO_MUX_CPU1, 5); // set GPIO54 and eQep2A
    GPIO_SetupPinMux(55, GPIO_MUX_CPU1, 5); // set GPIO54 and eQep2B
    EQep2Regs.QEPCTL.bit.QPEN = 0; // make sure qep reset
    EQep2Regs.QDECCTL.bit.QSRC = 0; // Quadrature count mode
    EQep2Regs.QPOSCTL.all = 0x0; // Disable eQep Position Compare
    EQep2Regs.QCAPCTL.all = 0x0; // Disable eQep Capture
    EQep2Regs.QEINT.all = 0x0; // Disable all eQep interrupts
    EQep2Regs.QPOSMAX = 0xFFFFFFFF; // use full range of the 32 bit count.
    EQep2Regs.QEPCTL.bit.FREE_SOFT = 2; // EQep uneffected by emulation suspend
    EQep2Regs.QPOSCNT = 0;
    EQep2Regs.QEPCTL.bit.QPEN = 1; // Enable EQep
}
float readEncLeft(void) {
    int32_t raw = 0;
    uint32_t QEP_maxvalue = 0xFFFFFFFFU; //4294967295U
    raw = EQep1Regs.QPOSCNT;
    if (raw >= QEP_maxvalue/2) raw -= QEP_maxvalue; // I don't think this is needed and never true
    // 100 slits in the encoder disk so 100 square waves per one revolution of the
    // DC motor's back shaft. Then Quadrature Decoder mode multiplies this by 4 so 400 counts per one rev
    // of the DC motor's back shaft. Then the gear motor's gear ratio is 30:1.
    return (raw*(TWOPI / (400 * 30)));
}
float readEncRight(void) {
    int32_t raw = 0;
    uint32_t QEP_maxvalue = 0xFFFFFFFFU; //4294967295U -1 32bit signed int
    raw = EQep2Regs.QPOSCNT;
    if (raw >= QEP_maxvalue/2) raw -= QEP_maxvalue; // I don't think this is needed and never true
    // 100 slits in the encoder disk so 100 square waves per one revolution of the
    // DC motor's back shaft. Then Quadrature Decoder mode multiplies this by 4 so 400 counts per one rev
    // of the DC motor's back shaft. Then the gear motor's gear ratio is 30:1.

    // BM: change the sign of it so that the calculated values are all positive in left and right
    return (-raw*(TWOPI / (400 * 30)));
}

// BM: control effort functions from lab 3
// BM: EPWM2A is used for the right wheel
void setEPWM2A(float controleffort) {
    // BM: check the bound of the controleffort first
    if (controleffort < -10) {
        controleffort = -10;
    }
    if (controleffort > 10) {
        controleffort = 10;
    }
    // BM: set CMPA
    EPwm2Regs.CMPA.bit.CMPA = 125.0 * controleffort + 1250.0;
}

// BM: EPWM2B is used for the left wheel
void setEPWM2B(float controleffort) {
    // BM: check the bound of the controleffort first
    if (controleffort < -10) {
        controleffort = -10;
    }
    if (controleffort > 10) {
        controleffort = 10;
    }
    // BM: set CMPB
    EPwm2Regs.CMPB.bit.CMPB = 125.0 * controleffort + 1250.0;
}

// BM: PID function
//float Right_E_k = 0;
//float Right_I_k = 0;
//float Left_E_k = 0;
//float Left_I_k = 0;
//float Right_E_k_prev = 0;
//float Right_I_k_prev = 0;
//float Left_E_k_prev = 0;
//float Left_I_k_prev = 0;
//float K_p = 3;
//float K_i = 5;
//float V_ref = 0.25;
float right_PID(void) {
    Right_E_k = V_ref - VRightK_m + Kp_turn * e_turn;
    // BM: saturation limit for uRight
    if (fabs(uRight) > 10.0) {
        Right_I_k = 0.95 * Right_I_k_prev;
    } else {
        Right_I_k = Right_I_k_prev + 0.004 * (Right_E_k + Right_E_k_prev) / 2;
    }
    Right_E_k_prev = Right_E_k;
    Right_I_k_prev = Right_I_k;
    return K_p * Right_E_k + K_i * Right_I_k;
}

float left_PID(void) {
    Left_E_k = V_ref - VLeftK_m - Kp_turn * e_turn;
    // BM: saturation limit for uLeft
    if (fabs(uLeft) > 10.0) {
        Left_I_k = 0.95 * Left_I_k_prev;
    } else {
        Left_I_k = Left_I_k_prev + 0.004 * (Left_E_k + Left_E_k_prev) / 2;
    }
    Left_E_k_prev = Left_E_k;
    Left_I_k_prev = Left_I_k;
    return K_p * Left_E_k + K_i * Left_I_k;
}

// BM: PosLeft and PosRight contains angles and past angles
// BM: we have theta_avg and theta_avg_past
// BM: the radius: use RADTOMETER
// BM: robot width: ROBOT_WIDTH
// BM: we have x_past and y_past
void coordinate_cal(void) {
    bearing = RADTOMETER / ROBOT_WIDTH * (PosRight[0] - PosLeft[0]);
//    theta_avg = 0.5 * (PosRight[0] + PosLeft[0]);
    theta_avg_dot = 0.5 * (VRightK + VLeftK);
    x_dot = RADTOMETER * theta_avg_dot * cos(bearing);
    y_dot = RADTOMETER * theta_avg_dot * sin(bearing);
    x += 0.004 * (x_dot + x_dot_past) / 2;
    y += 0.004 * (y_dot + y_dot_past) / 2;
    x_dot_past = x_dot;
    y_dot_past = y_dot;
}

